# Table of Contents
1. Importing Libraries
2. Reading Files
3. Merging Dataframes
4. Exporting Merged Dataframe

## 01. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## 02. Reading Files

In [6]:
# Setting path
path = r'/Users/niravbariya/Documents/Data Science/CareerFoundry/Data Analytics Immersion/Achievement 4/04-04-2024 Instacart Basket Analysis'

In [7]:
# Reading orders_products_combined.pkl
df_merged_large = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [8]:
# Reading products_checked.csv
df_prods = pd.read_csv(os.path.join(path,'02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

### Checking Shape

In [9]:
df_merged_large.shape

(32434489, 10)

## 03. Merging Dataframes

### Finding a common column for combining the dataframes

In [10]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [11]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

product_id is the common column between the two dataframes that can be used to combine the dataframes.

### Merging the two dataframes with a new indicator

In [12]:
# new_merge is the new indicator for this merging
df_ords_prods_merged = df_merged_large.merge(df_prods, on = 'product_id', indicator = 'new_merge')

In [13]:
df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices,new_merge
0,2539329,1,1,2,8,NaN,196,1,0,both,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,both,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,both,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,both,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,both,Soda,77,7,9.0,both

In [15]:
df_ords_prods_merged['new_merge'].value_counts()

new_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [14]:
df_ords_prods_merged.shape

(32404859, 15)

## 04. Exporting Merged Dataframe

In [16]:
# Exporting the dataframe as pickle file
df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge.pkl'))